In [3]:
import pandas as pd

In [4]:
df=pd.read_csv("titanic.csv")

In [5]:
df

,Unnamed: 0.1,Unnamed: 0,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,2,2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,3,3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,4,4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,886,886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,887,887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,888,888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,889,889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,890,890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [6]:
df.columns

Index(['Unnamed: 0.1', 'Unnamed: 0', 'PassengerId', 'Survived', 'Pclass',
       'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket', 'Fare', 'Cabin',
       'Embarked'],
      dtype='object')

In [7]:
df['Name']

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [8]:
type(df['Name'])

pandas.core.series.Series

In [9]:
df['Name'][2:4]

2                          Heikkinen, Miss. Laina
3    Futrelle, Mrs. Jacques Heath (Lily May Peel)
Name: Name, dtype: object

In [10]:
df.head()

,Unnamed: 0.1,Unnamed: 0,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,2,2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,3,3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,4,4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [11]:
df.head

<bound method NDFrame.head of      Unnamed: 0.1  Unnamed: 0  PassengerId  Survived  Pclass  \
0               0           0            1         0       3
1               1           1            2         1       1
2               2           2            3         1       3
3               3           3            4         1       1
4               4           4            5         0       3
..            ...         ...          ...       ...     ...
886           886         886          887         0       2
887           887         887          888         1       1
888           888         888          889         0       3
889           889         889          890         1       1
890           890         890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Cabin Embarked
0        0         A/5 21171   7.2500   NaN        S
1        0          PC 17599  71.2833   C85        C
2        0  STON/O2. 3101282   7.9250   NaN        S
3        0            113803  53.1000  C123        S
4        0            373450   8.0500   NaN        S
..     ...               ...      ...   ...      ...
886      0            211536  13.0000   NaN        S
887      0            112053  30.0000   B42        S
888      2        W./C. 6607  23.4500   NaN        S
889      0            111369  30.0000  C148        C
890      0            370376   7.7500   NaN        Q

[891 rows x 14 columns]>

In [12]:
len(df)

891

In [13]:
l=['a','b','c','d']
pd.Series(1)

0    1
dtype: int64

In [14]:
list

list

In [15]:
df['Name'][2:3]

2    Heikkinen, Miss. Laina
Name: Name, dtype: object

In [16]:
df['Sex']

0        male
1      female
2      female
3      female
4        male
        ...
886      male
887    female
888    female
889      male
890      male
Name: Sex, Length: 891, dtype: object

In [17]:
pd.Series(df['Name'][2:7],index=['a','b','c','d','e'])

a    NaN
b    NaN
c    NaN
d    NaN
e    NaN
Name: Name, dtype: object

In [18]:
s=pd.Series(list(df['Name'][2:7]),index=['a','b','c','d','e'])

In [19]:
s

a                          Heikkinen, Miss. Laina
b    Futrelle, Mrs. Jacques Heath (Lily May Peel)
c                        Allen, Mr. William Henry
d                                Moran, Mr. James
e                         McCarthy, Mr. Timothy J
dtype: object

In [20]:
s1 = df['Name'][2:5]

In [21]:
s1

2                          Heikkinen, Miss. Laina
3    Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                        Allen, Mr. William Henry
Name: Name, dtype: object

In [22]:
s+s1

a    NaN
b    NaN
c    NaN
d    NaN
e    NaN
2    NaN
3    NaN
4    NaN
dtype: object

In [23]:
#### append() method takes an object as an argument and add it to the end of an exsiting list

In [24]:
df.drop('PassengerId',axis=1,inplace=True)

In [25]:
df

,Unnamed: 0.1,Unnamed: 0,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,2,2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,3,3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,4,4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,886,886,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,887,887,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,888,888,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,889,889,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,890,890,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [26]:
df.drop(3,inplace=True)

In [27]:
df

,Unnamed: 0.1,Unnamed: 0,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,2,2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,4,4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,5,5,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,886,886,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,887,887,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,888,888,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,889,889,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,890,890,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [28]:
df.set_index('Name',inplace=True)

In [29]:
df.loc['Ticket','Fare']

KeyError: 'Ticket'

In [31]:
df.loc[3]

KeyError: 3

In [30]:
df.columns

Index(['Unnamed: 0.1', 'Unnamed: 0', 'Survived', 'Pclass', 'Sex', 'Age',
       'SibSp', 'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [32]:
df.head()

,Unnamed: 0.1,Unnamed: 0,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,,
"Braund, Mr. Owen Harris",0,0,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",1,1,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C
"Heikkinen, Miss. Laina",2,2,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
"Allen, Mr. William Henry",4,4,0,3,male,35.0,0,0,373450,8.0500,NaN,S
"Moran, Mr. James",5,5,0,3,male,NaN,0,0,330877,8.4583,NaN,Q

In [33]:
df

,Unnamed: 0.1,Unnamed: 0,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,,
"Braund, Mr. Owen Harris",0,0,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",1,1,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C
"Heikkinen, Miss. Laina",2,2,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
"Allen, Mr. William Henry",4,4,0,3,male,35.0,0,0,373450,8.0500,NaN,S
"Moran, Mr. James",5,5,0,3,male,NaN,0,0,330877,8.4583,NaN,Q
...,...,...,...,...,...,...,...,...,...,...,...,...
"Montvila, Rev. Juozas",886,886,0,2,male,27.0,0,0,211536,13.0000,NaN,S
"Graham, Miss. Margaret Edith",887,887,1,1,female,19.0,0,0,112053,30.0000,B42,S
"Johnston, Miss. Catherine Helen ""Carrie""",888,888,0,3,female,NaN,1,2,W./C. 6607,23.4500,NaN,S
"Behr, Mr. Karl Howell",889,889,1,1,male,26.0,0,0,111369,30.0000,C148,C
"Dooley, Mr. Patrick",890,890,0,3,male,32.0,0,0,370376,7.7500,NaN,Q

In [36]:
df.reset_index()( inplace=True)

TypeError: 'DataFrame' object is not callable

In [37]:
d={"Key":[2,4,5,6,7],
   "Key":[4,5,6,7],
   "Key":[2,3,4,5]}
pd.DataFrame(d)
## Note all list in dictionary must be of same length

   Key
0    2
1    3
2    4
3    5

In [38]:
d1={"Key1":[2,4,5,6,7],
   "Key2":[4,5,6,7],
   "Key3":[2,3,4,5]}
pd.DataFrame(d)

   Key
0    2
1    3
2    4
3    5

In [39]:
df.dropna(axis=1)

,Unnamed: 0.1,Unnamed: 0,Survived,Pclass,Sex,SibSp,Parch,Ticket,Fare
Name,,,,,,,,,
"Braund, Mr. Owen Harris",0,0,0,3,male,1,0,A/5 21171,7.2500
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",1,1,1,1,female,1,0,PC 17599,71.2833
"Heikkinen, Miss. Laina",2,2,1,3,female,0,0,STON/O2. 3101282,7.9250
"Allen, Mr. William Henry",4,4,0,3,male,0,0,373450,8.0500
"Moran, Mr. James",5,5,0,3,male,0,0,330877,8.4583
...,...,...,...,...,...,...,...,...,...
"Montvila, Rev. Juozas",886,886,0,2,male,0,0,211536,13.0000
"Graham, Miss. Margaret Edith",887,887,1,1,female,0,0,112053,30.0000
"Johnston, Miss. Catherine Helen ""Carrie""",888,888,0,3,female,1,2,W./C. 6607,23.4500
"Behr, Mr. Karl Howell",889,889,1,1,male,0,0,111369,30.0000
"Dooley, Mr. Patrick",890,890,0,3,male,0,0,370376,7.7500

In [40]:
df.fillna("Poo",inplace=True)

In [41]:
df

,Unnamed: 0.1,Unnamed: 0,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,,
"Braund, Mr. Owen Harris",0,0,0,3,male,22.0,1,0,A/5 21171,7.2500,Poo,S
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",1,1,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C
"Heikkinen, Miss. Laina",2,2,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,Poo,S
"Allen, Mr. William Henry",4,4,0,3,male,35.0,0,0,373450,8.0500,Poo,S
"Moran, Mr. James",5,5,0,3,male,Poo,0,0,330877,8.4583,Poo,Q
...,...,...,...,...,...,...,...,...,...,...,...,...
"Montvila, Rev. Juozas",886,886,0,2,male,27.0,0,0,211536,13.0000,Poo,S
"Graham, Miss. Margaret Edith",887,887,1,1,female,19.0,0,0,112053,30.0000,B42,S
"Johnston, Miss. Catherine Helen ""Carrie""",888,888,0,3,female,Poo,1,2,W./C. 6607,23.4500,Poo,S
"Behr, Mr. Karl Howell",889,889,1,1,male,26.0,0,0,111369,30.0000,C148,C
"Dooley, Mr. Patrick",890,890,0,3,male,32.0,0,0,370376,7.7500,Poo,Q

In [42]:
df.groupby('Sex').mean()

TypeError: unsupported operand type(s) for +: 'float' and 'str'

In [43]:
df.groupby('Sex').sum()

TypeError: unsupported operand type(s) for +: 'float' and 'str'

In [44]:
df.groupby('Sex').sum()['Fare']

TypeError: unsupported operand type(s) for +: 'float' and 'str'

In [45]:
df.groupby('Sex').mean()['Age']

TypeError: unsupported operand type(s) for +: 'float' and 'str'

In [46]:
df.groupby('Pclass').sum()

TypeError: unsupported operand type(s) for +: 'float' and 'str'

In [54]:
df3=df.groupby('Pclass').sum()

TypeError: unsupported operand type(s) for +: 'float' and 'str'

In [55]:
df3

NameError: name 'df3' is not defined

In [57]:
df.T

Name,"Braund, Mr. Owen Harris","Cumings, Mrs. John Bradley (Florence Briggs Thayer)","Heikkinen, Miss. Laina","Allen, Mr. William Henry","Moran, Mr. James","McCarthy, Mr. Timothy J","Palsson, Master. Gosta Leonard","Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)","Nasser, Mrs. Nicholas (Adele Achem)","Sandstrom, Miss. Marguerite Rut",...,"Markun, Mr. Johann","Dahlberg, Miss. Gerda Ulrika","Banfield, Mr. Frederick James","Sutehall, Mr. Henry Jr","Rice, Mrs. William (Margaret Norton)","Montvila, Rev. Juozas","Graham, Miss. Margaret Edith","Johnston, Miss. Catherine Helen ""Carrie""","Behr, Mr. Karl Howell","Dooley, Mr. Patrick"
Unnamed: 0.1,0,1,2,4,5,6,7,8,9,10,...,881,882,883,884,885,886,887,888,889,890
Unnamed: 0,0,1,2,4,5,6,7,8,9,10,...,881,882,883,884,885,886,887,888,889,890
Survived,0,1,1,0,0,0,0,1,1,1,...,0,0,0,0,0,0,1,0,1,0
Pclass,3,1,3,3,3,1,3,3,2,3,...,3,3,2,3,3,2,1,3,1,3
Sex,male,female,female,male,male,male,male,female,female,female,...,male,female,male,male,female,male,female,female,male,male
Age,22.0,38.0,26.0,35.0,Poo,54.0,2.0,27.0,14.0,4.0,...,33.0,22.0,28.0,25.0,39.0,27.0,19.0,Poo,26.0,32.0
SibSp,1,1,0,0,0,0,3,0,1,1,...,0,0,0,0,0,0,0,1,0,0
Parch,0,0,0,0,0,0,1,2,0,1,...,0,0,0,0,5,0,0,2,0,0
Ticket,A/5 21171,PC 17599,STON/O2. 3101282,373450,330877,17463,349909,347742,237736,PP 9549,...,349257,7552,C.A./SOTON 34068,SOTON/OQ 392076,382652,211536,112053,W./C. 6607,111369,370376
Fare,7.25,71.2833,7.925,8.05,8.4583,51.8625,21.075,11.1333,30.0708,16.7,...,7.8958,10.5167,10.5,7.05,29.125,13.0,30.0,23.45,30.0,7.75
Cabin,Poo,C85,Poo,Poo,Poo,E46,Poo,Poo,Poo,G6,...,Poo,Poo,Poo,Poo,Poo,Poo,B42,Poo,C148,Poo
Embarked,S,C,S,S,Q,S,S,S,C,S,...,S,S,S,S,Q,S,S,S,C,Q

In [59]:
df.transpose()

Name,"Braund, Mr. Owen Harris","Cumings, Mrs. John Bradley (Florence Briggs Thayer)","Heikkinen, Miss. Laina","Allen, Mr. William Henry","Moran, Mr. James","McCarthy, Mr. Timothy J","Palsson, Master. Gosta Leonard","Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)","Nasser, Mrs. Nicholas (Adele Achem)","Sandstrom, Miss. Marguerite Rut",...,"Markun, Mr. Johann","Dahlberg, Miss. Gerda Ulrika","Banfield, Mr. Frederick James","Sutehall, Mr. Henry Jr","Rice, Mrs. William (Margaret Norton)","Montvila, Rev. Juozas","Graham, Miss. Margaret Edith","Johnston, Miss. Catherine Helen ""Carrie""","Behr, Mr. Karl Howell","Dooley, Mr. Patrick"
Unnamed: 0.1,0,1,2,4,5,6,7,8,9,10,...,881,882,883,884,885,886,887,888,889,890
Unnamed: 0,0,1,2,4,5,6,7,8,9,10,...,881,882,883,884,885,886,887,888,889,890
Survived,0,1,1,0,0,0,0,1,1,1,...,0,0,0,0,0,0,1,0,1,0
Pclass,3,1,3,3,3,1,3,3,2,3,...,3,3,2,3,3,2,1,3,1,3
Sex,male,female,female,male,male,male,male,female,female,female,...,male,female,male,male,female,male,female,female,male,male
Age,22.0,38.0,26.0,35.0,Poo,54.0,2.0,27.0,14.0,4.0,...,33.0,22.0,28.0,25.0,39.0,27.0,19.0,Poo,26.0,32.0
SibSp,1,1,0,0,0,0,3,0,1,1,...,0,0,0,0,0,0,0,1,0,0
Parch,0,0,0,0,0,0,1,2,0,1,...,0,0,0,0,5,0,0,2,0,0
Ticket,A/5 21171,PC 17599,STON/O2. 3101282,373450,330877,17463,349909,347742,237736,PP 9549,...,349257,7552,C.A./SOTON 34068,SOTON/OQ 392076,382652,211536,112053,W./C. 6607,111369,370376
Fare,7.25,71.2833,7.925,8.05,8.4583,51.8625,21.075,11.1333,30.0708,16.7,...,7.8958,10.5167,10.5,7.05,29.125,13.0,30.0,23.45,30.0,7.75
Cabin,Poo,C85,Poo,Poo,Poo,E46,Poo,Poo,Poo,G6,...,Poo,Poo,Poo,Poo,Poo,Poo,B42,Poo,C148,Poo
Embarked,S,C,S,S,Q,S,S,S,C,S,...,S,S,S,S,Q,S,S,S,C,Q

In [71]:
df

,Unnamed: 0.1,Unnamed: 0,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,,
"Braund, Mr. Owen Harris",0,0,0,3,male,22.0,1,0,A/5 21171,7.2500,Poo,S
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",1,1,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C
"Heikkinen, Miss. Laina",2,2,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,Poo,S
"Allen, Mr. William Henry",4,4,0,3,male,35.0,0,0,373450,8.0500,Poo,S
"Moran, Mr. James",5,5,0,3,male,Poo,0,0,330877,8.4583,Poo,Q
...,...,...,...,...,...,...,...,...,...,...,...,...
"Montvila, Rev. Juozas",886,886,0,2,male,27.0,0,0,211536,13.0000,Poo,S
"Graham, Miss. Margaret Edith",887,887,1,1,female,19.0,0,0,112053,30.0000,B42,S
"Johnston, Miss. Catherine Helen ""Carrie""",888,888,0,3,female,Poo,1,2,W./C. 6607,23.4500,Poo,S
"Behr, Mr. Karl Howell",889,889,1,1,male,26.0,0,0,111369,30.0000,C148,C
"Dooley, Mr. Patrick",890,890,0,3,male,32.0,0,0,370376,7.7500,Poo,Q

In [72]:
df11=df[['Pclass','Survived','Pclass']][5:10]
df11

                                                   Pclass  Survived  Pclass
Name
McCarthy, Mr. Timothy J                                 1         0       1
Palsson, Master. Gosta Leonard                          3         0       3
Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)       3         1       3
Nasser, Mrs. Nicholas (Adele Achem)                     2         1       2
Sandstrom, Miss. Marguerite Rut                         3         1       3

In [74]:
df12=df[['Pclass','Survived','Pclass']][0:5]
df12

                                                    Pclass  Survived  Pclass
Name
Braund, Mr. Owen Harris                                  3         0       3
Cumings, Mrs. John Bradley (Florence Briggs Tha...       1         1       1
Heikkinen, Miss. Laina                                   3         1       3
Allen, Mr. William Henry                                 3         0       3
Moran, Mr. James                                         3         0       3

In [75]:
df11

                                                   Pclass  Survived  Pclass
Name
McCarthy, Mr. Timothy J                                 1         0       1
Palsson, Master. Gosta Leonard                          3         0       3
Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)       3         1       3
Nasser, Mrs. Nicholas (Adele Achem)                     2         1       2
Sandstrom, Miss. Marguerite Rut                         3         1       3

In [76]:
pd.concat([df11,df12])

                                                    Pclass  Survived  Pclass
Name
McCarthy, Mr. Timothy J                                  1         0       1
Palsson, Master. Gosta Leonard                           3         0       3
Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)        3         1       3
Nasser, Mrs. Nicholas (Adele Achem)                      2         1       2
Sandstrom, Miss. Marguerite Rut                          3         1       3
Braund, Mr. Owen Harris                                  3         0       3
Cumings, Mrs. John Bradley (Florence Briggs Tha...       1         1       1
Heikkinen, Miss. Laina                                   3         1       3
Allen, Mr. William Henry                                 3         0       3
Moran, Mr. James                                         3         0       3

In [77]:
pd.concat([df11, df12],axis=1)
##axis=1 mean vertical component  y axis
##axis=0  mean horizontalcomponent  x axis

,Pclass,Survived,Pclass,Pclass,Survived,Pclass
Name,,,,,,
"McCarthy, Mr. Timothy J",1.0,0.0,1.0,NaN,NaN,NaN
"Palsson, Master. Gosta Leonard",3.0,0.0,3.0,NaN,NaN,NaN
"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",3.0,1.0,3.0,NaN,NaN,NaN
"Nasser, Mrs. Nicholas (Adele Achem)",2.0,1.0,2.0,NaN,NaN,NaN
"Sandstrom, Miss. Marguerite Rut",3.0,1.0,3.0,NaN,NaN,NaN
"Braund, Mr. Owen Harris",NaN,NaN,NaN,3.0,0.0,3.0
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",NaN,NaN,NaN,1.0,1.0,1.0
"Heikkinen, Miss. Laina",NaN,NaN,NaN,3.0,1.0,3.0
"Allen, Mr. William Henry",NaN,NaN,NaN,3.0,0.0,3.0
"Moran, Mr. James",NaN,NaN,NaN,3.0,0.0,3.0

In [78]:
df5=pd.concat([df11, df12],axis=1)
df.fillna('silki')

,Unnamed: 0.1,Unnamed: 0,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,,
"Braund, Mr. Owen Harris",0,0,0,3,male,22.0,1,0,A/5 21171,7.2500,Poo,S
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",1,1,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C
"Heikkinen, Miss. Laina",2,2,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,Poo,S
"Allen, Mr. William Henry",4,4,0,3,male,35.0,0,0,373450,8.0500,Poo,S
"Moran, Mr. James",5,5,0,3,male,Poo,0,0,330877,8.4583,Poo,Q
...,...,...,...,...,...,...,...,...,...,...,...,...
"Montvila, Rev. Juozas",886,886,0,2,male,27.0,0,0,211536,13.0000,Poo,S
"Graham, Miss. Margaret Edith",887,887,1,1,female,19.0,0,0,112053,30.0000,B42,S
"Johnston, Miss. Catherine Helen ""Carrie""",888,888,0,3,female,Poo,1,2,W./C. 6607,23.4500,Poo,S
"Behr, Mr. Karl Howell",889,889,1,1,male,26.0,0,0,111369,30.0000,C148,C
"Dooley, Mr. Patrick",890,890,0,3,male,32.0,0,0,370376,7.7500,Poo,Q

In [79]:
df5 =df5.fillna('silki')

In [82]:
s=pd.Series(list(df['Pclass'][2:7]),index=['gitesh','silki','rina','roshini','santo'])
s1 = df['Pclass'][5:10]
s2=s+s1

In [83]:
s2=s+s1
s2.fillna("Gitesh",inplace=True)
s2

Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)    Gitesh
McCarthy, Mr. Timothy J                              Gitesh
Nasser, Mrs. Nicholas (Adele Achem)                  Gitesh
Palsson, Master. Gosta Leonard                       Gitesh
Sandstrom, Miss. Marguerite Rut                      Gitesh
gitesh                                               Gitesh
rina                                                 Gitesh
roshini                                              Gitesh
santo                                                Gitesh
silki                                                Gitesh
dtype: object

In [86]:
data1=pd.DataFrame ({'Key1':[1,2,4,5,6],
                    'Key2':[1,2,4,5,6],
                    'Key3':[1,2,4,5,9]})

In [99]:
data2=pd.DataFrame ({'Key1':[1,2,4,5,6],
                    'Key4':[1,2,4,5,6],
                    'Key5':[1,2,4,5,11]})

In [100]:
data1

   Key1  Key2  Key3
0     1     1     1
1     2     2     2
2     4     4     4
3     5     5     5
4     6     6     9

In [101]:
data2

   Key1  Key4  Key5
0     1     1     1
1     2     2     2
2     4     4     4
3     5     5     5
4     6     6    11

In [102]:
pd.merge(data1,data2)

   Key1  Key2  Key3  Key4  Key5
0     1     1     1     1     1
1     2     2     2     2     2
2     4     4     4     4     4
3     5     5     5     5     5
4     6     6     9     6    11

In [103]:
pd.merge(data1,data2,how='left')

   Key1  Key2  Key3  Key4  Key5
0     1     1     1     1     1
1     2     2     2     2     2
2     4     4     4     4     4
3     5     5     5     5     5
4     6     6     9     6    11

In [104]:
pd.merge(data1,data2,how='right')

   Key1  Key2  Key3  Key4  Key5
0     1     1     1     1     1
1     2     2     2     2     2
2     4     4     4     4     4
3     5     5     5     5     5
4     6     6     9     6    11

In [105]:
pd.merge(data1,data2,how='outer')

   Key1  Key2  Key3  Key4  Key5
0     1     1     1     1     1
1     2     2     2     2     2
2     4     4     4     4     4
3     5     5     5     5     5
4     6     6     9     6    11

In [106]:
pd.merge(data1,data2,how='cross')

    Key1_x  Key2  Key3  Key1_y  Key4  Key5
0        1     1     1       1     1     1
1        1     1     1       2     2     2
2        1     1     1       4     4     4
3        1     1     1       5     5     5
4        1     1     1       6     6    11
5        2     2     2       1     1     1
6        2     2     2       2     2     2
7        2     2     2       4     4     4
8        2     2     2       5     5     5
9        2     2     2       6     6    11
10       4     4     4       1     1     1
11       4     4     4       2     2     2
12       4     4     4       4     4     4
13       4     4     4       5     5     5
14       4     4     4       6     6    11
15       5     5     5       1     1     1
16       5     5     5       2     2     2
17       5     5     5       4     4     4
18       5     5     5       5     5     5
19       5     5     5       6     6    11
20       6     6     9       1     1     1
21       6     6     9       2     2     2
22       6     6     9       4     4     4
23       6     6     9       5     5     5
24       6     6     9       6     6    11

In [107]:
pd.merge(data1,data2,how='left',on='Key1')

   Key1  Key2  Key3  Key4  Key5
0     1     1     1     1     1
1     2     2     2     2     2
2     4     4     4     4     4
3     5     5     5     5     5
4     6     6     9     6    11

In [109]:
pd.merge(data1,data2,how='left',left_on='Key2',right_on='Key1')

   Key1_x  Key2  Key3  Key1_y  Key4  Key5
0       1     1     1       1     1     1
1       2     2     2       2     2     2
2       4     4     4       4     4     4
3       5     5     5       5     5     5
4       6     6     9       6     6    11

In [110]:
data1=pd.DataFrame ({'Key1':[1,2,4,5,6],
                    'Key2':[11,12,14,15,16],
                    'Key3':[12,22,42,52,29]},index=['a','b','c','d','e'])

In [116]:
data2=pd.DataFrame ({'Key6':[1,2,4,5,6],
                    'Key4':[1,2,4,5,6],
                    'Key5':[1,2,4,5,11]},index=['a','b','b','i','j'])

In [117]:
data1

   Key1  Key2  Key3
a     1    11    12
b     2    12    22
c     4    14    42
d     5    15    52
e     6    16    29

In [118]:
data2

   Key6  Key4  Key5
a     1     1     1
b     2     2     2
b     4     4     4
i     5     5     5
j     6     6    11

In [119]:
data1.join(data2)

   Key1  Key2  Key3  Key6  Key4  Key5
a     1    11    12   1.0   1.0   1.0
b     2    12    22   2.0   2.0   2.0
b     2    12    22   4.0   4.0   4.0
c     4    14    42   NaN   NaN   NaN
d     5    15    52   NaN   NaN   NaN
e     6    16    29   NaN   NaN   NaN

In [120]:
data1.join(data2,how='inner')

   Key1  Key2  Key3  Key6  Key4  Key5
a     1    11    12     1     1     1
b     2    12    22     2     2     2
b     2    12    22     4     4     4

In [121]:
data1.join(data2,how='right')

   Key1  Key2  Key3  Key6  Key4  Key5
a   1.0  11.0  12.0     1     1     1
b   2.0  12.0  22.0     2     2     2
b   2.0  12.0  22.0     4     4     4
i   NaN   NaN   NaN     5     5     5
j   NaN   NaN   NaN     6     6    11

In [122]:
data1.join(data2,how='outer')

   Key1  Key2  Key3  Key6  Key4  Key5
a   1.0  11.0  12.0   1.0   1.0   1.0
b   2.0  12.0  22.0   2.0   2.0   2.0
b   2.0  12.0  22.0   4.0   4.0   4.0
c   4.0  14.0  42.0   NaN   NaN   NaN
d   5.0  15.0  52.0   NaN   NaN   NaN
e   6.0  16.0  29.0   NaN   NaN   NaN
i   NaN   NaN   NaN   5.0   5.0   5.0
j   NaN   NaN   NaN   6.0   6.0  11.0

In [123]:
data1.join(data2,how='cross')

    Key1  Key2  Key3  Key6  Key4  Key5
0      1    11    12     1     1     1
1      1    11    12     2     2     2
2      1    11    12     4     4     4
3      1    11    12     5     5     5
4      1    11    12     6     6    11
5      2    12    22     1     1     1
6      2    12    22     2     2     2
7      2    12    22     4     4     4
8      2    12    22     5     5     5
9      2    12    22     6     6    11
10     4    14    42     1     1     1
11     4    14    42     2     2     2
12     4    14    42     4     4     4
13     4    14    42     5     5     5
14     4    14    42     6     6    11
15     5    15    52     1     1     1
16     5    15    52     2     2     2
17     5    15    52     4     4     4
18     5    15    52     5     5     5
19     5    15    52     6     6    11
20     6    16    29     1     1     1
21     6    16    29     2     2     2
22     6    16    29     4     4     4
23     6    16    29     5     5     5
24     6    16    29     6     6    11

In [124]:
df.head()

,Unnamed: 0.1,Unnamed: 0,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,,
"Braund, Mr. Owen Harris",0,0,0,3,male,22.0,1,0,A/5 21171,7.2500,Poo,S
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",1,1,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C
"Heikkinen, Miss. Laina",2,2,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,Poo,S
"Allen, Mr. William Henry",4,4,0,3,male,35.0,0,0,373450,8.0500,Poo,S
"Moran, Mr. James",5,5,0,3,male,Poo,0,0,330877,8.4583,Poo,Q

In [125]:
df["Fare_inr"]=df['Fare'].apply(lambda x:x*80)
df.head()

,Unnamed: 0.1,Unnamed: 0,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Fare_inr
Name,,,,,,,,,,,,,
"Braund, Mr. Owen Harris",0,0,0,3,male,22.0,1,0,A/5 21171,7.2500,Poo,S,580.000
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",1,1,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C,5702.664
"Heikkinen, Miss. Laina",2,2,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,Poo,S,634.000
"Allen, Mr. William Henry",4,4,0,3,male,35.0,0,0,373450,8.0500,Poo,S,644.000
"Moran, Mr. James",5,5,0,3,male,Poo,0,0,330877,8.4583,Poo,Q,676.664

In [130]:
df["len_Name"]=df['Sex'].apply(len)
df.head()

,Unnamed: 0.1,Unnamed: 0,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Fare_inr,len_Name
Name,,,,,,,,,,,,,,
"Braund, Mr. Owen Harris",0,0,0,3,male,22.0,1,0,A/5 21171,7.2500,Poo,S,580.000,4
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",1,1,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C,5702.664,6
"Heikkinen, Miss. Laina",2,2,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,Poo,S,634.000,6
"Allen, Mr. William Henry",4,4,0,3,male,35.0,0,0,373450,8.0500,Poo,S,644.000,4
"Moran, Mr. James",5,5,0,3,male,Poo,0,0,330877,8.4583,Poo,Q,676.664,4

In [131]:
def inr_con(x):
    return x*80
df['Fare_inr'] = df['Fare'].apply(inr_con)
df.head()

,Unnamed: 0.1,Unnamed: 0,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Fare_inr,len_Name
Name,,,,,,,,,,,,,,
"Braund, Mr. Owen Harris",0,0,0,3,male,22.0,1,0,A/5 21171,7.2500,Poo,S,580.000,4
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",1,1,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C,5702.664,6
"Heikkinen, Miss. Laina",2,2,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,Poo,S,634.000,6
"Allen, Mr. William Henry",4,4,0,3,male,35.0,0,0,373450,8.0500,Poo,S,644.000,4
"Moran, Mr. James",5,5,0,3,male,Poo,0,0,330877,8.4583,Poo,Q,676.664,4

In [133]:
def create_flag(x):
   if x <10:
       return " cheap"
   elif x>=10 and x<20:
      return "mind" 
   else:
      return "high"

In [134]:
df['Flag_fare']=df["Fare"].apply(create_flag)
df.head()

,Unnamed: 0.1,Unnamed: 0,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Fare_inr,len_Name,Flag_fare
Name,,,,,,,,,,,,,,,
"Braund, Mr. Owen Harris",0,0,0,3,male,22.0,1,0,A/5 21171,7.2500,Poo,S,580.000,4,cheap
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",1,1,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C,5702.664,6,high
"Heikkinen, Miss. Laina",2,2,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,Poo,S,634.000,6,cheap
"Allen, Mr. William Henry",4,4,0,3,male,35.0,0,0,373450,8.0500,Poo,S,644.000,4,cheap
"Moran, Mr. James",5,5,0,3,male,Poo,0,0,330877,8.4583,Poo,Q,676.664,4,cheap

In [135]:
df.tail()

,Unnamed: 0.1,Unnamed: 0,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Fare_inr,len_Name,Flag_fare
Name,,,,,,,,,,,,,,,
"Montvila, Rev. Juozas",886,886,0,2,male,27.0,0,0,211536,13.00,Poo,S,1040.0,4,mind
"Graham, Miss. Margaret Edith",887,887,1,1,female,19.0,0,0,112053,30.00,B42,S,2400.0,6,high
"Johnston, Miss. Catherine Helen ""Carrie""",888,888,0,3,female,Poo,1,2,W./C. 6607,23.45,Poo,S,1876.0,6,high
"Behr, Mr. Karl Howell",889,889,1,1,male,26.0,0,0,111369,30.00,C148,C,2400.0,4,high
"Dooley, Mr. Patrick",890,890,0,3,male,32.0,0,0,370376,7.75,Poo,Q,620.0,4,cheap